### Terraform Plan Results

**Status:** ✅ Success

<details><summary>Show Plan</summary>

```terraform
data.external.modal_source_hash: Reading...
null_resource.slack_bot_build[0]: Refreshing state... [id=8804915470984343234]
null_resource.linear_bot_build[0]: Refreshing state... [id=1482635249691537205]
null_resource.github_bot_build[0]: Refreshing state... [id=7640239795921156673]
module.modal_app.null_resource.modal_secrets[0]: Refreshing state... [id=2225170984708266380]
null_resource.web_app_cloudflare_build[0]: Refreshing state... [id=7646790242166182173]
module.modal_app.null_resource.modal_volume[0]: Refreshing state... [id=2222745261245959176]
null_resource.control_plane_build: Refreshing state... [id=8625982013750015361]
module.linear_kv[0].cloudflare_workers_kv_namespace.this: Refreshing state... [id=d0fabbf492394b898704fe4ecb86c576]
module.media_bucket.cloudflare_r2_bucket.this: Refreshing state... [id=axiom-media]
module.session_index_kv.cloudflare_workers_kv_namespace.this: Refreshing state... [id=8126febb0e7949eeb096ccf016008e02]
module.slack_kv[0].cloudflare_workers_kv_namespace.this: Refreshing state... [id=852dadc0916f4464b019669df4c142c7]
cloudflare_d1_database.main: Refreshing state... [id=da0fe8f6-a901-48fa-8824-c6adff2269bf]
data.external.modal_source_hash: Read complete after 0s [id=-]
module.modal_app.null_resource.modal_deploy: Refreshing state... [id=3124416002751241918]
null_resource.d1_migrations: Refreshing state... [id=1644771452536249845]
local_file.web_app_wrangler_production[0]: Refreshing state... [id=e0cab8b9761ffbdb61a673c899d96ff4b6fc6e4c]
module.slack_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=afd8e0ba9823422e894d211681438061]
module.slack_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=bb678729-67ac-4ef5-a975-f9d3efb02d04]
module.slack_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=e3629c20-4dd4-4bfe-836c-342f7bdce82c]
module.linear_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=c1efb82478e0442ba8bef806da2f3bfd]
module.linear_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=30e56feb-6a6b-4640-94ce-efeceeeb9d69]
module.linear_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=b778d420-635b-4c4f-b99e-02995bb45a46]
module.control_plane_worker.cloudflare_worker.this: Refreshing state... [id=7f1c0652d79747f689ea3d298758bfa0]
module.control_plane_worker.cloudflare_workers_cron_trigger.this[0]: Refreshing state... [id=open-inspect-control-plane-axiom]
module.control_plane_worker.cloudflare_worker_version.this: Refreshing state... [id=2b44a37c-5713-479b-8bb4-9434fd685573]
module.control_plane_worker.cloudflare_workers_deployment.this: Refreshing state... [id=ec99180b-7f98-4a1a-b87e-27d312837439]
null_resource.web_app_cloudflare_deploy[0]: Refreshing state... [id=9022370893884545860]
module.github_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=a3025199361745048f99e43812dcb23f]
null_resource.web_app_cloudflare_secrets[0]: Refreshing state... [id=8533833138633735708]
module.github_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=589a4b46-9b87-41ec-b4f0-52b46da4052e]
module.github_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=2a8e9d6e-e10f-4d4b-b054-e56ddfce674f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.web_app_wrangler_production[0] will be created
  + resource "local_file" "web_app_wrangler_production" {
      + content              = <<-EOT
            name = "open-inspect-web-axiom"
            main = ".open-next/worker.js"
            compatibility_date = "2025-08-15"
            compatibility_flags = ["nodejs_compat", "global_fetch_strictly_public"]
            
            [vars]
            GITHUB_CLIENT_ID = "Iv23liEAFAb4nzrefZxt"
            BETTER_AUTH_URL = "https://open-inspect-web-axiom.axioshq.workers.dev"
            CONTROL_PLANE_URL = "https://open-inspect-control-plane-axiom.axioshq.workers.dev"
            NEXT_PUBLIC_WS_URL = "wss://open-inspect-control-plane-axiom.axioshq.workers.dev"
            ALLOWED_USERS = "abothra-axios,bchapman0111,bezunesh,cisarjosh,daveflr,dcumberland,drewipsonhq,ianwonghq,indi-rin,jprobst21,kaleonakakura,larrynaupari,msafranchik94,nhaggmark-axios,nodnarbnitram,ppedrazzi,rtj-1000,timothyfulmer,timreinkeaxios,tpickett,vik-wed"
            ALLOWED_EMAIL_DOMAINS = "axioshq.com"
            
            [assets]
            directory = ".open-next/assets"
            binding = "ASSETS"
            
            [[d1_databases]]
            binding = "AUTH_DB"
            database_id = "da0fe8f6-a901-48fa-8824-c6adff2269bf"
            database_name = "open-inspect-axiom"
            
            [[services]]
            binding = "CONTROL_PLANE_WORKER"
            service = "open-inspect-control-plane-axiom"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../..//packages/web/wrangler.production.toml"
      + id                   = (known after apply)
    }

  # null_resource.control_plane_build must be replaced
-/+ resource "null_resource" "control_plane_build" {
      ~ id       = "8625982013750015361" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-10T18:30:20Z" -> (known after apply)
        }
    }

  # null_resource.d1_migrations must be replaced
-/+ resource "null_resource" "d1_migrations" {
      ~ id       = "1644771452536249845" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "migrations_sha" = "8235301118a3da2dbefdcffdb1a59f540592c8d77b49365c7f5c8ef4b5d508d8" -> "95fb69a0486a78a79e5a26f4e323a5185008502e63137faf963aa3144a8154b4"
            # (1 unchanged element hidden)
        }
    }

  # null_resource.github_bot_build[0] must be replaced
-/+ resource "null_resource" "github_bot_build" {
      ~ id       = "7640239795921156673" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-10T16:21:17Z" -> (known after apply)
        }
    }

  # null_resource.linear_bot_build[0] must be replaced
-/+ resource "null_resource" "linear_bot_build" {
      ~ id       = "1482635249691537205" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-10T18:30:20Z" -> (known after apply)
        }
    }

  # null_resource.slack_bot_build[0] must be replaced
-/+ resource "null_resource" "slack_bot_build" {
      ~ id       = "8804915470984343234" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-10T16:21:17Z" -> (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_build[0] must be replaced
-/+ resource "null_resource" "web_app_cloudflare_build" {
      ~ id       = "7646790242166182173" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-10T18:30:20Z" -> (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_deploy[0] must be replaced
-/+ resource "null_resource" "web_app_cloudflare_deploy" {
      ~ id       = "9022370893884545860" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-10T18:30:38Z" -> (known after apply)
        }
    }

  # module.control_plane_worker.cloudflare_worker.this will be updated in-place
  ~ resource "cloudflare_worker" "this" {
        id             = "7f1c0652d79747f689ea3d298758bfa0"
        name           = "open-inspect-control-plane-axiom"
      ~ observability  = {
          ~ enabled            = false -> true
          ~ logs               = {
              ~ enabled            = false -> true
                # (2 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
      ~ references     = {
          ~ dispatch_namespace_outbounds = [] -> (known after apply)
          ~ domains                      = [] -> (known after apply)
          ~ durable_objects              = [
              - {
                  - namespace_id   = "680f002ba9424e8b8f43e03f66117462" -> null
                  - namespace_name = "open-inspect-control-plane-axiom_SessionAgent" -> null
                  - worker_id      = "7f1c0652d79747f689ea3d298758bfa0" -> null
                  - worker_name    = "open-inspect-control-plane-axiom" -> null
                },
              - {
                  - namespace_id   = "8ecdd6c1dde445768eb471a1ef205a01" -> null
                  - namespace_name = "open-inspect-control-plane-axiom_SchedulerDO" -> null
                  - worker_id      = "7f1c0652d79747f689ea3d298758bfa0" -> null
                  - worker_name    = "open-inspect-control-plane-axiom" -> null
                },
              - {
                  - namespace_id   = "938e1dcee4f64209ba19738567e8bf1c" -> null
                  - namespace_name = "open-inspect-control-plane-axiom_SandboxContainer" -> null
                  - worker_id      = "7f1c0652d79747f689ea3d298758bfa0" -> null
                  - worker_name    = "open-inspect-control-plane-axiom" -> null
                },
            ] -> (known after apply)
          ~ queues                       = [] -> (known after apply)
          ~ workers                      = [
              - {
                  - id   = "c1efb82478e0442ba8bef806da2f3bfd" -> null
                  - name = "open-inspect-linear-bot-axiom" -> null
                },
              - {
                  - id   = "a7cfc48b74f9459c9721b65085f20df6" -> null
                  - name = "open-inspect-web-axiom" -> null
                },
              - {
                  - id   = "a3025199361745048f99e43812dcb23f" -> null
                  - name = "open-inspect-github-bot-axiom" -> null
                },
              - {
                  - id   = "afd8e0ba9823422e894d211681438061" -> null
                  - name = "open-inspect-slack-bot-axiom" -> null
                },
            ] -> (known after apply)
        } -> (known after apply)
        tags           = []
      ~ updated_on     = "2026-03-12T15:25:19Z" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.control_plane_worker.cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-10T18:30:31Z" -> (known after apply)
      ~ id                  = "2b44a37c-5713-479b-8bb4-9434fd685573" -> (known after apply)
      + limits              = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "../../..//packages/control-plane/dist/index.js" -> null
              - content_sha256 = "48c0f6574021b4c89cb67c8a42249016d52fe60196010148ca085124cd56b92c" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "../../..//packages/control-plane/dist/index.js"
              + content_sha256 = "b144b12d8156cbeee0c9dd78bf8f48c042f2adbc9a6b4a769233d6abc6be4c8b"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 13 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 83 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.control_plane_worker.cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "josh.cisar@axioshq.com" -> (known after apply)
      ~ created_on   = "2026-03-10T18:30:35Z" -> (known after apply)
      ~ id           = "ec99180b-7f98-4a1a-b87e-27d312837439" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "2b44a37c-5713-479b-8bb4-9434fd685573" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.github_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-10T16:21:33Z" -> (known after apply)
      ~ id                  = "589a4b46-9b87-41ec-b4f0-52b46da4052e" -> (known after apply)
      + limits              = (known after apply)
      ~ number              = 3 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 6 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.github_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "josh.cisar@axioshq.com" -> (known after apply)
      ~ created_on   = "2026-03-10T16:21:34Z" -> (known after apply)
      ~ id           = "2a8e9d6e-e10f-4d4b-b054-e56ddfce674f" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "589a4b46-9b87-41ec-b4f0-52b46da4052e" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.linear_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-10T18:30:23Z" -> (known after apply)
      ~ id                  = "30e56feb-6a6b-4640-94ce-efeceeeb9d69" -> (known after apply)
      + limits              = (known after apply)
      ~ number              = 20 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 4 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.linear_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "josh.cisar@axioshq.com" -> (known after apply)
      ~ created_on   = "2026-03-10T18:30:26Z" -> (known after apply)
      ~ id           = "b778d420-635b-4c4f-b99e-02995bb45a46" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "30e56feb-6a6b-4640-94ce-efeceeeb9d69" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.modal_app.null_resource.modal_deploy must be replaced
-/+ resource "null_resource" "modal_deploy" {
      ~ id       = "3124416002751241918" -> (known after apply)
      ~ triggers = { # forces replacement
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "secrets_created" = (sensitive value)
          ~ "source_hash"     = "ec9c348bd5ca84f107703e5ca203c8cd26dc0d4e4c76ae8041257f5c5dc7cef0" -> "1177d53eb6a12bb0703b154f0f485897c6f07e442aaff2acc55cb424cc600e80"
            # (2 unchanged elements hidden)
        }
    }

  # module.modal_app.null_resource.modal_secrets[0] must be replaced
-/+ resource "null_resource" "modal_secrets" {
      ~ id       = "2225170984708266380" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "secrets_hash" = (sensitive value)
        }
    }

  # module.slack_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-10T16:21:19Z" -> (known after apply)
      ~ id                  = "bb678729-67ac-4ef5-a975-f9d3efb02d04" -> (known after apply)
      + limits              = (known after apply)
      ~ number              = 14 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 6 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.slack_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "josh.cisar@axioshq.com" -> (known after apply)
      ~ created_on   = "2026-03-10T16:21:20Z" -> (known after apply)
      ~ id           = "e3629c20-4dd4-4bfe-836c-342f7bdce82c" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "bb678729-67ac-4ef5-a975-f9d3efb02d04" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 18 to add, 1 to change, 17 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pushed by: @CisarJosh*